tests/mocks/edit_payment.json

{
    "id": "pay_CBYy6tLmJTzn3Q",
    "entity": "payment",
    "amount": 1000,
    "currency": "INR",
    "status": "authorized",
    "order_id": null,
    "invoice_id": null,
    "international": false,
    "method": "netbanking",
    "amount_refunded": 0,
    "refund_status": null,
    "captured": false,
    "description": null,
    "card_id": null,
    "bank": "UTIB",
    "wallet": null,
    "vpa": null,
    "email": "testme@acme.com",
    "notes": {
      "key1": "value1",
      "key2": "value2"
    },
    "fee": null,
    "tax": null,
    "error_code": null,
    "error_description": null,
    "error_source": null,
    "error_step": null,
    "error_reason": null,
    "acquirer_data": {
      "bank_transaction_id": "0125836177"
    },
    "created_at": 1553504328
  }